app/controllers/posts_controller.rb

	 def create
	 	@post = Post.new(post_params)
	 	if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"